# 24. В фермерском хозяйстве в Карелии выращивают чернику.
# Она растёт на круглой грядке, причём кусты высажены только по окружности.
# Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растёт N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора
# на них выросло различное число ягод — на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники.
# Эта система состоит из управляющего модуля и нескольких собирающих модулей.
# Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом,
# собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод,
# которое может собрать за один заход собирающий модуль,
# находясь перед некоторым кустом заданной во входном файле грядки.

def max_berry_harvest(bushes) :
    n = len(bushes)
    max_harvest = 0

    for i in range(n) :
        total_harvest = bushes[i] + bushes[(i - 1) % n] + bushes[(i + 1) % n]
        max_harvest = max(max_harvest, total_harvest)

    return max_harvest


bushes = [10, 5, 8, 3, 6]
result = max_berry_harvest(bushes)
print(result)